{"doc_number": "3651916", "country_code": "EP", "kind_code": "B1", "lang": "EN", "date": "2022/06/29", "classification-ipcr": ["B07C 5/02"], "claims": ["1. Inspektionsvorrichtung zum visuellen Inspizieren von elastischen Partikeln, umfassend\nein Förderband (12) zum Einspeisen einer Vielzahl von Partikeln, insbesondere in vorwiegend horizontaler Richtung,\neinen Fallkanal (14), um die Partikel mittels Schwerkraft abwärts fallen zu lassen, wobei der Fallkanal (14) nachgeordnet zu dem Förderband (12) angeordnet ist, und\nmindestens eine Klappe (16) zum Stoppen eines horizontalen Anteils der Bewegung der Partikel, die das Förderband (12) verlassen, wobei die mindestens eine Klappe (16) nachgeordnet zu dem Förderband (12) angeordnet ist,\nwobei die Klappe (16) in der horizontalen Richtung nachgiebig ist, um mindestens einen Teil, insbesondere einen größeren Anteil der kinetischen Energie des Partikels, die in horizontaler Richtung ausgerichtet ist, abzubauen.", "2. Inspektionsvorrichtung nach Anspruch 1, wobei der Betrag der inelastischen Kollision des Partikels mit der Klappe (16) größer als der Betrag der elastischen Kollision des Partikels mit der Klappe (16) ist.", "3. Inspektionsvorrichtung nach Anspruch 1 oder 2, wobei die Klappe (16) aus einem elastischen Material gefertigt ist, das eine höhere Elastizität als Stahl aufweist, wobei die Klappe (16) insbesondere ein gespanntes Lagenmaterial umfasst, insbesondere umfassend ein Kautschukmaterial und/oder ein Kunststoffmaterial, das auf einem Textil bereitgestellt wird.", "4. Inspektionsvorrichtung nach einem der Ansprüche 1 bis 3, wobei die Klappe (16) und/oder eine innere Oberfläche des Fallkanals (14) mit einer Beschichtung beschichtet ist/sind, die ein Antihaftmaterial und/oder ein elastisches Material umfasst, insbesondere einen Siliciumlack.", "5. Inspektionsvorrichtung nach einem der Ansprüche 1 bis 4, wobei ein Detektierungssystem (24) zum Detektieren der Farbe und/oder der Größe der Partikel in dem Fallkanal (14) bereitgestellt wird, wobei das Detektierungssystem (24) eingerichtet ist, um die Partikel nur von einer Seite zu inspizieren.", "6. Inspektionsvorrichtung nach Anspruch 5, wobei mindestens ein Teil einer Kanalwand (26) des Fallkanals (14) für ein Inspektionslicht (20) reflektierend ist, das von dem Detektierungssystem (24) bereitgestellt wird, wobei die reflektierende Kanalwand (26) gegenüber einem Eintritt des Inspektionslichts (20) in den Fallkanal (14) bereitgestellt wird.", "7. Inspektionsvorrichtung nach Anspruch 5 und 6, wobei das Inspektionslicht (20), das von dem Detektierungssystem (24) bereitgestellt wird, einen Lichtgenerator (22) über eine Emissionsöffnung verlässt, wobei ein Lichtpfad des Inspektionslichts (20) zwischen der Emissionsöffnung und einem Eintritt in den Fallkanal (14) mindestens teilweise von einem Staubschutz (36) abgedeckt wird, um ein Eindringen von Partikeln in die Emissionsöffnung zu verhindern.", "8. Inspektionsvorrichtung nach Anspruch 7, wobei ein schützendes Ablenkmittel (30), insbesondere eine Luftpistole, zum Ablenken von Partikeln zwischen der Emissionsöffnung und dem Staubschutz (36) bereitgestellt wird.", "9. Inspektionsvorrichtung nach einem der Ansprüche 1 bis 8, wobei mindestens ein Sammelbehälter (28, 34) nachgeordnet zu dem Fallkanal (14) bereitgestellt wird, wobei ein Abstand zwischen dem maximalen Füllpegel des Sammelbehälters (28, 34) und einer oberen Einfassung des Sammelbehälters (28, 34) größer als eine maximale Höhe eines Partikels ist, das von einem Partikel abprallt, das an dem maximalen Füllpegel angeordnet ist, nachdem es einen Abstand der vollen Höhe des Fallkanals (14) bis zu dem maximalen Füllpegel gefallen ist.", "10. Inspektionsvorrichtung nach Anspruch 9, wobei mindestens ein Teil des Sammelbehälters (28, 34) zwischen dem maximalen Füllpegel und der oberen Einfassung in Bezug auf die vertikale Richtung geneigt ist.", "11. Inspektionsvorrichtung nach einem der Ansprüche 1 bis 10, wobei das Förderband (12) eine Schütteleinheit umfasst, um die Partikel auf das Förderband (12) zu schütteln.", "12. Inspektionsvorrichtung nach einem der Ansprüche 1 bis 11, wobei ein Sortiergitter zum Abtrennen von zu großen Partikeln bereitgestellt wird, wobei das Sortiergitter insbesondere vorgeordnet zu dem Förderband (12) angeordnet ist.", "13. Verfahren zum Inspizieren von elastischen Partikeln, wobei\nelastische Partikel in eine Inspektionsvorrichtung (24) nach einem der Ansprüche 1 bis 12 eingespeist werden,\ndie Form und/oder die Farbe der elastischen Partikel innerhalb des Fallkanals (14) inspiziert werden, und\nPartikel, deren Form und/oder Farbe innerhalb oder außerhalb eines Satzes gegebener Parameter liegt, aussortiert werden, indem diese Partikel aus dem Fallpfad der Partikel abgelenkt werden.", "14. Verfahren nach Anspruch 13, wobei die Partikel aus Butylkautschuk, insbesondere halogeniertem Butylkautschuk, gefertigt sind.", "15. Verfahren nach Anspruch 13 oder 14, wobei die Partikel eine Härte h in Shore A von 40 ≤ h ≤ 85 bei 23 °C gemäß DIN ISO 7619-1 aufweisen."], "description": ["[0001]    The present invention is directed to an inspection apparatus and a method, by means of which elastic particles can be visually inspected, particularly in order to safeguard a specific form and/or color of the particles. The particles may be inspected for surface contamination.", "[0002]    EP 2 671 651 A1  and  EP 2 468 426 A1  disclose an inspection apparatus, where food products like green beans or nuts can be visually inspected for removing unwanted products. The inspection apparatus comprises a conveyor belt by which the food product are move into a fall channel where the food products are scanned from two opposing sides for detecting the form and the color of the food products. Unwanted products are removed by means of a reject system.", "[0003]    US 2007/0 039 856 A1  describes an apparatus for sorting products, in particular granular products as raisins, blueberries but also pellet e.g. plastic pellets. The sorting system comprises a supply system, a detecting system, a selecting system and a chute.", "[0004]    When butyl rubber is produced the butyl rubber is present after a polymerization process in form of crumbs of different size. Since these butyl rubber particles are sticky it is possible that several particles agglomerate to a very large particle which may lead to problems in a subsequent processing step. Further it is possible that some particles are not correctly polymerized which may also lead to problems in a subsequent processing step. The not correctly polymerized particles comprises a different color compared to the correctly polymerized particles. Hence, there is a permanent need of sorting unwanted butyl rubber particles out of a plurality of butyl rubber particles.", "[0005]    However, the butyl rubber particles are very elastic so that the butyl rubber particles have a tendency of bouncing away in unpredictable directions when a force is applied to the butyl rubber particles. For that reason the inspection apparatus as disclosed in  EP 2 671 651 A1  and  EP 2 468 426 A1  proofed as being not suitable for sorting out unwanted elastic butyl rubber particles, since the elastic butyl rubber particles bounced away from the scanning trajectory during the scanning step unpredictably so that the reject system is not able to remove a certain particle with the required accurate recovery. The apparatus of  US 2007/0 039 856 A1  exhibits similar disadvantages.", "[0006]    It is the objective of the invention providing measures enabling a sorting out of unwanted particles out of a plurality of elastic particles during a visual inspection with a good accuracy.", "[0007]    The solution of this objective is provided according to the invention by an inspection apparatus according to the features of claim 1 as well as by a method according to claim 13. Preferred embodiments of the invention are given by the dependent claims and the following description.", "[0008]    According to the invention an inspection apparatus for visual inspecting elastic particles is provided, in particular comprising a conveyor belt for feeding a plurality of particles, particularly in mainly horizontal direction, a fall channel for letting the particles fall downwards due to gravity, wherein the fall channel is arranged downstream the conveyor belt, and at least one flap for stopping a horizontal portion of the movement of the particles leaving the conveyor belt, wherein the at least one flap is arranged downstream the conveyor belt, wherein the flap is resilient in horizontal direction for dissipating at least a part, particularly a majority, of the kinetic energy of the particle aligned in horizontal direction.", "[0009]    The particles are moved by means of the conveyor belt. Due to the momentum of the particles when the particles reach the end of the conveyor belt the particles leave the conveyor belt and hit the flap. Particularly the at least one flap is arranged upstream the fall channel, particularly at least upstream the majority of the fall channel or preferably upstream an outlet of the fall channel. Due to its resilient behavior of the flap that flap may be elastically deformed by the kinetic energy of the particle so that at least a part of the kinetic energy of the particle may be dissipated by the deforming flap. The elastic flap may damp the movement of the particle and/or reduces the momentum of the particle energized by the movement of the conveyor belt. The respective particle may drip down the flap in mainly vertical direction without a significant rebounding in horizontal direction. Preferably a plurality of flaps are provided so that the respective particle may rebound in a zig-zag-course between two flaps and/or a wall of the fall channel and the same or at least one further flap. Every time when the particle meets a flap at least a part of the kinetic energy of the particle directed in horizontal direction can be dissipated so that the particle may fall downwards mainly vertically when leaving the at least on flap or a chicane of a plurality of flaps. Particularly at least one wall, preferably all walls, of the fall channel is resilient in horizontal direction and/or comprises elastic material for dissipating at least a part, particularly a majority, of the kinetic energy of the particle aligned in horizontal direction, so that the fall channel itself may also damp a rebounding of the particle in horizontal direction. By means of the flap the elastic particles, particularly butyl rubber particles, are able to perform a curve from a mainly horizontal movement to a mainly vertical movement without an unpredictable bouncing so that the particles do not bounce away from a scanning trajectory of a detection system. In turn, a deflection means which may comprise a reject system, may remove a certain particle identified by the detection system with a higher accuracy. The risk that the deflection means, particularly an air gun, may miss the identified particle or even hit the wrong particle is reduced. The inspection apparatus may be further designed as described in  EP 2 671 651 A1  and  EP 2 468 426 A .", "[0010]    Due the to the resilient elastic flaps it is possible using an inspection apparatus suitable only for rigid non-sticky inelastic particles for very elastic and/or sticky particles. Due to the resilient flaps a horizontal rebounding of the elastic particles is reduced, so that a sorting out of unwanted particles out of a plurality of elastic particles during a visual inspection with a good accuracy is enabled.", "[0011]    Particularly the amount of an inelastic collision of the particle to the flap is greater than the amount of the elastic collision of the particle to the flap. The collision of the elastic particle with the flap may be a mixture of an elastic collision and an inelastic collision. Due to the greater amount of the inelastic collision a majority of the kinetic energy of the particle can be absorbed by the flap. For instance, a significant amount of the kinetic energy of the particle may be transformed into strain energy of the flap and/or friction.", "[0012]    Preferably the flap is made from an elastic material comprising a higher elasticity than steel, wherein the flap particularly comprises a tensed up sheet material, particularly comprising a rubber material and/or a plastic material provided on a textile. The flap may be sufficiently soft for dissipating a significant amount of the kinetic energy of the particle. The flap may be tensed up at two ends facing away from each other, wherein a particular resilient behavior and/or damping behavior may be adjusted by the applied tension.", "[0013]    Particularly preferred the flap and/or an inner surface of the fall channel is coated with a coating comprising an anti-stick material and/or an elastic material, particularly a silicon varnish. Due to this coating even sticky particles may be processed by the inspection apparatus. Particularly an agglomeration of sticky particles at the flap and/or at the wall of the fall channel may be prevented, so that a fouling of the apparatus is prevented. Particularly preferred the coating comprises a chrome layer coated with a silicon layer. This coating shows better test results compared with a Teflon coating, when butyl rubber particles are fed to the inspection apparatus. The anti-stick material may comprise a Ni-Cr alloy applied onto the designated substrate, like a wall of the fall channel, for example by means of plasma thermal spraying. A ceramic primer may be provided onto the alloy and/or the material of the flap, wherein a release agent, particularly thermal cross-linked silicones, is provided onto the ceramic primer for providing a multilayer anti-stick material. The ceramic primer may provide an adhesion between the Ni-Cr alloy and the release agent or between the material of the flap and the release agent. The coating thickness of the Ni-Cr alloy, the ceramic primer and/or the release agent may be ca. 100 µm - 175 µm.", "[0014]    Particularly a detection system for detecting the color and/or the size of the particles in the fall channel is provided, wherein the detection system is adapted to inspect the particles from one side only. The detection system may comprise a laser or other light generator for scanning the particles and a light detector for detecting the light reflected by the particle. The signals of the light detector may be analyzed in an image evaluation system, by which the size and/or the color of the particle may be determined. If the analyzed data indicates parameters which are out of a set predefined range the respective particle may be qualified as being unwanted which have to be sorted out from the remaining particles. In this case it is possible that a deflection means, particularly an air gun, may apply a horizontal force to the unwanted particle so that the unwanted particle may be collected at a different place than the remaining particles. Since the flaps prevents an unpredictable bouncing of the elastic particles the further trajectory of the elastic particles may be easily calculated by the detection system so that the deflection means may find the correct particle with a higher accuracy. The calculation effort of the detection system for determining the further trajectory of the elastic particles may be reduced so that a shorter reply time is possible. This enables a shorter height of fall for the elastic particles until an unwanted particle may be sorted out. Surprisingly, the inspection of the falling elastic particles from one side only is sufficient so that a second system for inspecting the particle from the opposite side can be omitted. If a butyl rubber particle is not correctly polymerized the color of this particle is mainly uniform, so that the detection of the color at one side is sufficient. The case of two differently colored sides of one particle does not take place usually. Further the butyl rubber particles are not plate-like formed but based on a more spherical form. Hence, it is not necessary to determine the whole three-dimensional form of one particle. Instead it is sufficient to determine the size of the particle in one scanning plane for estimating the size of the whole particle with a sufficient accuracy. Since a comparison of two or more different images can be omitted the determination of the size and/or the color of the particle is significantly facilitated and accelerated. This enables a shorter height of fall for the elastic particles until an unwanted particle may be sorted out. The reduced required height of fall provides additional building space which can be used for preventing a rebounding of the elastic particle into an unintended area when the elastic particle hits a ground at the end of its movement downwards.", "[0015]    Preferably at least a part of a channel wall of the fall channel is reflective for an inspection light provided from the detection system, wherein the reflective channel wall is provided opposing an entry of the inspection light into the fall channel. Since the particle is inspected from one side only, the opposing side may be designed like a mirror for the light of the detection system. The detection may be able to compare the light reflected by the particle with the light reflected from the channel wall for determining the size and/or the color of the particle. The light reflected from the channel wall may be used as a reference light so that the detection system may be well operable even in different and/or changing lighting conditions. The risk of an error performed by the detection system may be reduced.", "[0016]    Particularly preferred the inspection light provided from the detection system leaves a light generator via an emission opening, wherein a light path of the inspection light between the emission opening and an entry into the fall channel is at least partially covered by a dust shield for preventing an intrusion of particles into the emission opening. For example due to abrasion of the particles very fine dust particles may occur onto the flap. The dust particles may comprise a such low weight that the dust particle may transported against gravity by means of a thermal up wind generated by the heat of the inspection light emitted by the detection system. The dust shield prevents an intrusion of the dust particles into an optic system of the detection system via the emission opening. Further a shadowing effects of the dust particles crossing the light path of the inspection light are prevented, so that the accuracy of the detection system is not decreased by occurring dust particles. If so, an outer surface of the dust shield may be fouled by an agglomeration of sticky dust particles but the emission opening and/or the entry of the inspection light into the fall channel do not narrow significantly by agglomerating sticky dust particles. The period of time between two maintenances for cleaning the inspection apparatus may be extended which in turn increases the working period of the inspection apparatus.", "[0017]    Particularly a protective deflection means, particularly an air gun, for deflecting particles is provided between the emission opening and the dust shield. The protective deflection means may keep dust particles away from the emission opening and/or from the entry of the inspection light into the fall channel. The protective deflection means is adapted providing a force for deflecting the dust particles away without optically hampering the lighting conditions for the inspection light.", "[0018]    Preferably at least one collection container is provided downstream the fall channel, wherein a distance between the maximum filling level of the collection container and an upper rim of the collection container is greater than a maximum height of a particle rebounded from a particle arrange at the maximum filling level after falling a distance of the full height of the fall channel until the maximum filling level. It is used the insight that due to the high elasticity of the elastic particles the elastic particles may bounce back when the elastic particles hit the ground. Due to the significant oversizing of the collection container compared to the maximum filling level an elastic particle falling into the collection container may not escape the collection container again or rebound over the upper rim of the collection container. Usually a collection container for collecting the wanted particles and a collection container for collecting the unwanted particles are arranged side by side, particularly via a dividing wall. Due to the height of at least one of the collection containers it is prevented that a particle for the one collection container may bounce into the other collection container. An impairment of the accuracy for sorting out unwanted particles at a position downstream the detection system and the deflection means is prevented. The collection container may comprise an opening at its bottom, particularly for feeding a conveyor where the particles are transported to a further processing step.", "[0019]    Particularly preferred at least a part of the collection container between the maximum filling level and the upper rim is inclined with respect to the vertical direction. The collection container may comprise a curved course so that a rebounding elastic particle may hit an upper wall of the collection container. The elastic particle may bounce such that the elastic particle provides a zig-zag-course between an upper wall and a lower wall of the inclined part of the collection container, so that the elastic particle does not bounce out of the collection container even when the elastic particle hits a wall of the collection container before passing the maximum filling level.", "[0020]    Particularly the conveyor belt comprises a shaking unit for shaking the particles onto the conveyor belt. The shaking of the conveyor belt may prevent an agglomeration of sticky elastic particles located onto the conveyor belt. An agglomerated particle may by broken into smaller particle which may comprise the intended size. If an agglomerated particle cannot be broken into smaller ones this agglomerated particle may be sorted out. But when the shaking unit prevents an agglomeration or brake an agglomerated particle the amount of unwanted particles and the amount of rejected waste may be reduced.", "[0021]    Preferably a sorting grit for separating too large particles out is provided, wherein particularly the sorting grit is arranged upstream the conveyor belt. The sorting grit may break larger agglomerated particles of sticking elastic particles into smaller ones which may pass the sorting grit. If a large particle cannot be broken into smaller ones this particle can be removed by means of the sorting grit without the need of removing this particle by means of the detection system. The risk that the deflection system may have not sufficient power for sorting out a very large and heavy particle is prevented. The risk that a very large particle is plugging and/or blocking the mainly vertical fall channel is prevented, thus increasing the continuous operation time of the detection device between maintenance intervals.", "[0022]    The invention is further directed to a method for inspecting elastic particles wherein an inspection apparatus, which may be designed as previously described, is fed with elastic particles, the form and/or the color of the elastic particles are inspected inside the fall channel and particles whose form and/or color are inside or outside a set of given parameters are sorted out by deflecting these particles out of the falling path of the particles. Due to the resilient flaps a horizontal rebounding of the elastic particles is reduced, so that a sorting out of unwanted particles out of a plurality of elastic particles during a visual inspection with a good accuracy is enabled.", "[0023]    Particularly the particles are made from butyl rubber (IIR), particularly halogenated butyl rubber. In the alternate the particles may be made from BR, SSBR, NdBR, LiBR, EPDM or similar elastic and/or sticky and/or hygroscopic material. Due to the specific design of the flaps particularly in combination with the specific anti-stick coating even such elastic and/or sticky particles can be fed to the inspection apparatus without the risk of fouling within a short period of time.", "[0024]    Preferably the particles comprises a hardness h in Shore A of 40 ≤ h ≤ 85 at 23°C according to DIN ISO 7619-1. Due to the specific design of the flaps a bouncing of such elastic particles inside the fall channel may be significantly reduced so that it may be prevented that particles bounce out of a scanning trajectory of the inspection apparatus.", "[0025]    These and other aspects of the invention will be apparent from and elucidated with reference to the embodiments described hereinafter. In the drawings:\nFig. 1 : is a schematic perspective view of an inspection apparatus.", "[0026]    The inspection apparatus 10 as illustrated in  Fig. 1  comprises a conveyor belt 12 feeding elastic particles into a fall channel 14. The fall channel 14 comprises a plurality of elastic flaps 16 which are resilient in horizontal direction for stopping the elastic particles in a way that the elastic particle do not bounce away horizontally but drop downwards at least after meeting some of the flaps 16. A trajectory 18 of the elastic particles can be bended from a horizontal direction on the conveyor belt 12 into a mostly vertical direction inside the fall channel 14 by means of the resilient flaps 16.", "[0027]    The elastic particles are scanned by a laser inspection light 20 from one side only inside the fall channel 14 or after leaving the fall channel 14. The inspection light 20 is produced in a light generator 22 of a detection system 24. The inspection light 20 is reflected by the elastic particle and/or a reflective channel wall 26 of the fall channel 14. The reflected light can be detected by the detection system 24 for instance by means of photoelectric cells and/or a camera so that the color and/or the form of the elastic particle can be determined. When the inspected elastic particle is acceptable the elastic particle falls further into a collection container 28 for collecting accepted elastic particles. When the inspected elastic particle is not acceptable a deflection means 30 in the form of an air gun provides a force in horizontal direction and changes the trajectory 18 of the elastic particle into a deflected trajectory 32 so that the rejected elastic particle falls into a further collection container 34 for collecting rejected elastic particles which should be removed from the accepted elastic particles. The collection container 28, 34 are open at its bottom so that the collected particles may fall onto a further conveyor for transporting the particles to a further processing step.", "[0028]    For example due to abrasion of the elastic particles very fine dust particles may occur onto the flap 16. The light generator 22 as well as detection means of the detection system 24 are protected by the intrusion of these dust particles by means of a dust shield 36 arranged above the inspection light 20. Particularly the dust shield 36 may protrude along the light path of the inspection light 20."]}