{"doc_number": "3682781", "country_code": "EP", "kind_code": "A1", "lang": "EN", "date": "2020/07/22", "classification-ipcr": ["A47L 9/02"], "claims": ["1. Vacuum cleaner nozzle (N), comprising:\nan air inlet area (AIA) having a front-end boundary (FEB), the front-end boundary (FEB) having a predetermined number of front openings (FO); and\nfront guide elements (FGE) having a surface at an angle to the front-end boundary (FEB) for guiding dirt towards the front openings (FO), openings left by the front guide elements being aligned with the front openings (FO), a width of the openings left by the front guide elements (FGE) not exceeding 300% of a width of the front openings (FO).", "2. Vacuum cleaner nozzle as claimed in claim 1, wherein the front-end boundary (FEB) has between 4 and 6 front openings (FO).", "3. Vacuum cleaner nozzle as claimed in any of the preceding claims, wherein an aperture of the front openings (FO) is between 5x5 mm<2> and 7x7 mm<2>.", "4. Vacuum cleaner nozzle as claimed in any of the preceding claims, wherein the nozzle (N) is supported by the front-end boundary (FEB) and wheels (W) at a rear end of the nozzle (N), the front-end boundary (FEB) being a brush strip.", "5. Vacuum cleaner nozzle as claimed in any of the preceding claims, wherein\nthe air inlet area (AIA) has a rear-end boundary (REB) having a predetermined number of rear openings (RO);\nthe nozzle (N) further comprising rear guide elements (RGE) having a surface at an angle to the rear-end boundary (REB) for guiding dirt towards the rear openings (RO), openings left by the rear guide elements being aligned with the rear openings (RO), a width of the openings left by the rear guide elements (RGE) not exceeding 300% of a width of the rear openings (RO).", "6. Vacuum cleaner nozzle as claimed in claim 5, wherein the rear-end boundary (REB) has between 4 and 6 rear openings (RO).", "7. Vacuum cleaner nozzle as claimed in any of the preceding claims 5-6, wherein an aperture of the rear openings (RO) is between 5x5 mm<2> and 7x7 mm<2>.", "8. Vacuum cleaner nozzle as claimed in any of the preceding claims 5-7, wherein the rear-end boundary (REB) is formed by a flexible strip.", "9. Vacuum cleaner provided with a vacuum cleaner nozzle (N) as claimed in any of the preceding claims, a suction generator for generating an airflow through the nozzle, and a dirt separation unit for separating dirt from the airflow."], "description": ["FIELD OF THE INVENTION", "[0001]    The invention relates to a vacuum cleaner nozzle, and a vacuum cleaner provided with such a vacuum cleaner nozzle.", "BACKGROUND OF THE INVENTION", "[0002]    EP 3 003 111 B1 (attorneys' reference 2014PF00103) discloses a nozzle for a vacuum cleaner, the nozzle comprising a base having an edge, a suction aperture in the base, and at least one flexible flap protruding from the base between the edge and the suction aperture, the flexible flap having first and second sections separable by an opening. The first and second sections are arranged to be urged towards each other when the nozzle is moved in a first direction in which the edge is a leading edge to close the opening or tend the opening towards closing, and to be urged away from each other when the nozzle is moved in a second direction in which the edge is a trailing edge to open the opening or to further open the opening.", "[0003]    WO 2009/133031 A1 discloses a vacuum cleaner nozzle, in particular for use in an advance and reverse direction, having a nozzle head and a nozzle base, in which at least one suction port is implemented, from which dirt catching elements are disposed upstream at least in the advance direction, which are disposed rigidly on the nozzle head and/or the nozzle base and/or are implemented so they can be at least partially countersunk into the nozzle head, wherein at least a part of said dirt catching elements have a cross section tapering away from said suction port in said advance and/or reverse directions such that a hollow area acting as a dirt trap is implemented on the side facing toward said suction port, wherein openings for the passage of dirt particles are provided laterally to each dirt catching element. The nozzle according to the invention is equally suitable for receiving coarse and also fine dirt on hard floors or on carpets. In particular, it can be implemented as a floor or cushion nozzle or also as a so-called furniture brush.", "[0004]    US 2018/333027 A1 discloses a suction nozzle that has two auxiliary suction paths which are generally the same as one another in structure and function. The auxiliary suction paths are spaced along with width of the suction chamber. More particularly, one auxiliary suction path is positioned around 1/4 of the way along the width of the suction chamber and the other auxiliary suction path is positioned around 3/4 of the way along the width of the suction chamber. Each auxiliary suction path extends from an entrance at the front of the suction nozzle (i.e. the part of the suction nozzle that faces forwards from the perspective of the user during normal use), and opens into a suction chamber. Each auxiliary suction path is defined by an open-bottomed channel formed in the underside in that each path has a top wall and side walls, but no bottom wall. In use, the bottom wall of each auxiliary suction path is formed by the surface being cleaned. The entrance of each auxiliary suction path tapers from a wider upstream portion (at the front of the entrance) to a narrower downstream portion (at the rear of the entrance). Extending between the entrance of each auxiliary suction path and the suction chamber is a passage of generally rectangular cross section. The auxiliary suction paths are configured to form large debris paths. They are therefore relatively large in cross section, to allow large debris to pass through them and into the suction chamber. The narrowest point of each auxiliary suction path in this particular case is the height of its passage (i.e. the distance between the top wall of the passage and a surface being cleaned), which is around 6 mm. A Dyson pneumatic cleaner head similarly has two openings, but they have a smaller width than in this patent application.", "[0005]    US 2016/213215 A1 discloses a vacuum cleaner head having a base and a suction opening in the base. An array of flexible flaps protrudes from the base. The flexible flaps are configured to act on a surface to be cleaned. The flexible flaps are spaced from each other to allow the passage of detritus there-between in a predefined arrangement. The predefined arrangement of the flexible flaps is configured to promote a non-linear flow path through the array of flexible flaps between an end of the base and the suction opening. A gap between first and second rows of flaps is substantially equal to or greater than a space between adjacent flexible flaps in each of the first and second rows. The rows do not need to be straight rows; for example, curved rows are alternatively possible. With this arrangement it is possible to create a non-linear path to the suction opening which will help maximize air resistance and so ensure a high vacuum is generated by the vacuum cleaner head. Therefore, cleaning performance of the vacuum cleaner head is improved. Furthermore, the flexible flaps help to form a seal with the surface to be cleaned whilst allowing the passage of detritus to the suction opening. The provision of flexible flaps may aid the dislodgement of detritus from a surface to be cleaned due to the resilience of the flaps. Furthermore, the flexible flaps are urged against the surface to be cleaned. The array of flexible flaps may also help define an elongate air flow path between the end of the base and the suction opening that provides a high resistance to the passage of air to help maximize the detritus pick-up capabilities of the vacuum cleaner head.", "[0006]    Due to increasingly strict energy label requirements relating to vacuum cleaners, there is a need to perform well on dust pick up levels on hard floors with crevices. To achieve a high performance on hard floors with crevices, the brush strips in the nozzle should be as closed as possible at the front and rear sides of the nozzle. This enables the highest possible air flow levels through the sides of the nozzle, enabling a high crevice performance.", "[0007]    However, for a user it is also important to be able to pick up large particles as rice and crumbs. To enable a good pick up of such large particles, the brushes should have many and large sized openings (> 5x5 mm) to enable the particles to enter the nozzle.", "[0008]    These two performance aspects (crevice cleaning + coarse dust pick up) lead to contradicting requirements with respect to the brush. The difficulty in trade-off between requirements is more urgent now than in the past. Due to EU regulations, the input power level of the vacuum cleaners has gone down, and is still decreasing. This requires optimizations that were not needed in the past. To get an A+ or an A++ energy label, input power levels may not exceed 450-700 W. Lower than ever before.", "[0009]    Currently, some manufacturers solve this issue by delivering 2 nozzles in the box:\na special crevice nozzle, which has closed brushes at front and back side of the nozzle OR brushes with only very limited number and size of apertures. The rear brush can alternatively be a rubber strip.\na normal nozzle to allow for coarse dust pick up, which have lots of openings and mostly also large sized openings (> 5x5 mm<2>).", "[0010]    There are even nozzles that have open brushes that can be closed or covered by the user by providing an additional switch or lever. This requires an action by the user to switch between the two modes during the cleaning job. Such extra switching and sliding mechanisms add an additional burden on the user.", "SUMMARY OF THE INVENTION", "[0011]    It is, inter alia, an object of the invention to provide an improved vacuum cleaner nozzle. The invention is defined by the independent claims. Advantageous embodiments are defined in the dependent claims.", "[0012]    One aspect of the invention provides a vacuum cleaner nozzle, comprising an air inlet area having a front-end boundary, the front-end boundary having a predetermined number of front openings, and front guide elements having a surface at an angle to the front-end boundary for guiding dirt towards the front openings, openings left by the front guide elements being aligned with the front openings, a width of the openings left by the front guide elements not exceeding 300% of a width of the front openings.", "[0013]    As the width of the openings left by the front guide elements does not exceed 300% of the width of the front openings, the front guide elements are able to more or less directly shift the dirt towards the front openings without there being a need for an airflow parallel to a front end of a nozzle, as a sufficiently strong air flow may not be present with low-power appliances that get favorable energy labels. Preferably, the width of the openings left by the front guide elements does not exceed 200% of the width of the front openings, and more preferably, the width of the openings left by the front guide elements matches the width of the front openings, so that dirt is easily shifted into the front openings. The same holds, mutatis mutandis, for a width of the openings left by the rear guide elements in relation to a width of the rear openings.", "[0014]    The front-end boundary preferably has between 4 and 6 front openings. This allows for a much easier access to the air inlet area than if there are only 2 front openings.", "[0015]    An aperture of the front openings is preferably between 5x5 mm<2> and 7x7 mm<2>. This size provides a good compromise between low air leakage needed to get a good crevice performance, and a suitable ability to suck up dirt particles on the floor.", "[0016]    Embodiments allows for favorable energy labels and a good dirt pick-up, also as regards relatively large particles. Embodiments provide a nozzle configuration that delivers both crevice and coarse dust pick up performance in 1 setting, so without the need for the user to switch between nozzles, or operate a switch or lever on a nozzle during use on hard floors. This configuration can be used for a hard-floor-only nozzle, or, as a hard floor setting in a multi-purpose nozzle where the user can switch between a hard floor setting and a soft floor setting.", "[0017]    To solve the contradiction between a closed brush (to guarantee a good crevice performance) and a brush with many and large openings (to enable coarse pick up), embodiments are based on the idea to use only a few openings in the brush, while ensuring that all coarse dust will enter the nozzle via these openings by guiding such coarse dirt towards these openings via V-shaped flexible (e.g. rubber) guide members in front of the brush. Such a 'zigzag' geometry ensures that all coarse particles will be guided towards the openings in the brush. This enables that the number of openings in the brush can be very limited, e.g. 4 to 6 (e.g. 5) apertures is preferred, which limited number of openings would be insufficient to allow good coarse pick up in a configuration without zigzag elements as coarse dirt would mainly be moved forward by the closed parts of the brush. Preferably, a size of the openings should be between 5x5 mm<2> and 7x7 mm<2>.", "[0018]    These and other aspects of the invention will be apparent from and elucidated with reference to the embodiments described hereinafter.", "BRIEF DESCRIPTION OF THE DRAWINGS", "[0019]    Fig. 1 shows an embodiment of a nozzle in accordance with the invention.", "DESCRIPTION OF EMBODIMENTS", "[0020]    In the embodiment of Fig. 1 , a central air-inlet area AIA is delimited by a front-end boundary FEB and a rear-end boundary REB. Each boundary FEB, REB has 5 openings FO, RO. Dirt is guided towards these openings FO, RO by slanted structures FGE, RGE, which are in this embodiment formed by zig-zag flexible (e.g. rubber) strips that each have openings that aligned with the openings in the front-end boundary FEB and the rear-end boundary REB. These flexible strips preferably reach to the floor, so that all dirt is wiped towards the openings FO, RO. The front-end boundary FEB is formed by a brush. The nozzle N is supported by the brush FEB at the front, and by wheels W at the rear end. In the shown nozzle having single hinge H, which nozzle has no flexibility between soleplate and wheels, the rear-end boundary REB is formed by a flexible (e.g. rubber) strip to prevent over-determined geometry towards the floor, ensuring a good sealing of the brushes FEB and rubbers REB with the floor. The nozzle N has side openings SO that may be 7 mm high and 35 mm wide to get a good crevice performance. The nozzle embodiment of Fig. 1 further has lint pickers LP having a plurality of triangular-shaped elements as described in our earlier application EP18192041.4 (attorneys' reference 2018PF00821), incorporated herein by reference.", "[0021]    In an alternative embodiment, this configuration of brush and zigzag can be positioned both at the front side of the nozzle (forward movement of the nozzle) and also at the rear side of the nozzle (for a backward stroke).", "[0022]    When the embodiment of Fig. 1 was tested in combination with a 480 W vacuum cleaner, about 93% of rice and lentils could be picked up in a single stroke, while various prior art vacuum cleaners could only do so at much higher power levels; at comparable power levels much less would be picked up in a single stroke.", "[0023]    The nozzle of Fig. 1 differs from the nozzle of WO 2009/133031 A1 in that the prior art nozzle does not have front and rear boundaries FEB, REB that close off the triangular structures FGE, RGE. The prior art dirt trap at the inside of a triangle will result in a lot of noise, which is avoided in the embodiment of Fig. 1 as the straight brush/strip close the triangular spaces so that they cannot act as dirt trap. The number of openings per front or rear side in WO 2009/133031 A1 is 10, which is twice as large as the number of openings in Fig. 1 .", "[0024]    It should be noted that the above-mentioned embodiments illustrate rather than limit the invention, and that those skilled in the art will be able to design many alternative embodiments without departing from the scope of the appended claims. In the claims, any reference signs placed between parentheses shall not be construed as limiting the claim. The word \"comprising\" does not exclude the presence of elements or steps other than those listed in a claim. The word \"a\" or \"an\" preceding an element does not exclude the presence of a plurality of such elements. In the device claim enumerating several means, several of these means may be embodied by one and the same item of hardware. Measures recited in mutually different dependent claims may advantageously be used in combination."]}