{"doc_number": "3901558", "country_code": "EP", "kind_code": "B1", "lang": "EN", "date": "2022/03/23", "classification-ipcr": ["F41B 9/00"], "claims": ["1. Eine Wasserpistole (1) aufweisend mindestens: einen Druckbehälter (10), eine Düse (20), einen Schlauch (60) und ein Ventil (30) mit einer Ventilleitung (38), wobei\n- der Druckbehälter (10) einen Auslass hat, der mit einem Einlass (61) des Schlauches (60) verbunden ist,\n- der Schlauch (60) einen Auslass (65) hat, der mit einem Einlassanschluss (31) der Ventilleitung (38) verbunden ist, und\n- ein Auslassanschluss der Ventilleitung (38) in Fluidverbindung mit der Düse (20) steht,\n- das Ventil (30) einen Ventilantrieb (40) aufweist, der konfiguriert ist, um einen Ventilschaft (35) von seiner Schließposition in seine Offenposition und/oder zurück von seiner Offenposition in seine Schließposition zu verschieben,\ndadurch gekennzeichnet, dass\n- der Ventiltrieb (40) einen beweglich gelagerten und durch den Ventilantrieb (40) verschiebbar ausgebildeten Körper (45) zumindest im Wesentlichen parallel, d. h. innerhalb von ±15°, zur durch den Schaft (35) definierten Längsachse (2) von einer Startposition über eine Zwischenposition zu einer Endposition antreibt, wobei der Körper und der Ventilschaft über eine positionsselektive Kupplung gekoppelt sind, wobei die positionsselektive Kupplung konfiguriert ist, um den Körper (45) selektiv mit dem Ventilschaft (35) zu koppeln, wenn sich der Körper (45) in der Zwischenposition befindet, während sich der Körper von der Startposition in die Endposition bewegt,\n- die positionsselektive Kupplung einen beweglich gelagerten Mitnehmer (50) aufweist,\n- ein Linearlager den Körper (45) und den Mitnehmer (50) beweglich koppelt, wobei das Linearlager es dem Körper (45) und dem Mitnehmer (50) ermöglicht, sich relativ zueinander zu verschieben, wobei die Verschiebung parallel zur Längsachse ist (2),\n- ein Anschlag (54, 55), der durch eine Oberfläche des Mitnehmers (50) oder des Körpers (45) definiert wird, ist konfiguriert, um die axiale Bewegung des Körpers (45) relativ zum Mitnehmer (50) zu begrenzen, wenn sich der Körper (45) von seiner Startposition in eine Zwischenposition und/oder von der Endposition des Körpers in die Startposition des Körpers bewegt,\n- der Mitnehmer (50) am Ventilschaft (35) befestigt oder einstückig mit diesem ausgebildet ist.", "2. Die Wasserpistole (1) nach Anspruch 1, dadurch gekennzeichnet, dass\n- die Ventilleitung (38) einen Ventilsitz (32) zwischen dem Einlassanschluss (31) und dem Auslassanschluss aufweist,\n- der bewegliche Ventilschaft (35) einen Ventilstopfen (36) hat, wobei der Ventilschaft (35)\n∘ eine erste Längsachse (2) definiert,\n∘ und eine Schließposition hat, in welcher der Ventilstopfen (36) den Ventilsitz verschließt und eine offene Position hat, in welcher der Ventilstopfen (36) zurückgezogen ist, um einen Fluidfluss durch den Ventilsitz (32) zu ermöglichen,und dass\n- der Schlauch (60) eine Schlauchwand (67) hat, wobei die Schlauchwand (67) ein Linearlager (68) bereitstellt,\n- das Linearlager (68)\n∘ den Ventilschaft (35) relativ zur Schlauchwand (67) beweglich lagert, wodurch eine Verschiebung entlang einer Längsachse (2) des Ventilschafts (35) ermöglicht wird,\n∘ abdichtend am Ventilschaft (35) anliegt, und\n∘ ein Durchgangsloch definiert, durch welches sich der Ventilschaft (35) durch die Schlauchwand (67) erstreckt.", "3. Die Wasserpistole (1) nach Anspruch 1 oder 2, dadurch gekennzeichnet, dass der Schlauch (60) einen ersten Abschnitt (63) und einen zweiten Abschnitt (64) aufweist, wobei der erste Abschnitt (63) eine erste kontinuierlich gekrümmte neutrale Phase (62) hat und wobei der zweite Abschnitt eine zweite kontinuierlich gekrümmte neutrale Phase (66) aufweist, wobei die beiden Krümmungen entgegengesetzte Vorzeichen haben.", "4. Die Wasserpistole (1) nach Anspruch 2 und 3, dadurch gekennzeichnet, dass das durch das Linearlager (68) definierte Durchgangsloch in einem Bereich der Schlauchwand (67) angeordnet ist, welcher sich in der Nähe der Änderung des Vorzeichen der Krümmung der neutralen Phase des Schlauches (60) befindet, wobei die Nähe mit 25 % der Länge des Schlauches (60) definiert ist.", "5. Die Wasserpistole nach einem der vorhergehenden Ansprüche, dadurch gekennzeichnet, dass die Netto-Querschnittsfläche des Schlauches (60) entlang der Länge des Schlauches (60) innerhalb von 15 % der mittleren Querschnittsfläche des Schlauches konstant ist, wobei die Querschnittsfläche des Ventilschafts (35) nicht zur Netto-Querschnittsfläche des Schlauches (60) beiträgt.", "6. Die Wasserpistole nach einem der vorhergehenden Ansprüche, dadurch gekennzeichnet, dass der Körper (45) in seine Startposition federvorgespannt ist.", "7. Die Wasserpistole nach einem der vorhergehenden Ansprüche, dadurch gekennzeichnet, dass das Linearlager, das den Körper (45) und den Mitnehmer (50) beweglich koppelt, Folgendes aufweist:\n- mindestens einen Schlitz (53) mit einer sich parallel zur Längsachse (2) erstreckenden Länge, wobei der mindestens eine Schlitz (53) in den Mitnehmer (50) integriert oder an diesem befestigt ist,\n- zumindest ein Vorsprung des Körpers (45) greift beweglich in den Schlitz (53) ein.", "8. Die Wasserpistole nach einem der vorhergehenden Ansprüche, dadurch gekennzeichnet, dass das Linearlager, das den Körper (45) und den Mitnehmer (50) beweglich koppelt, Folgendes aufweist:\n- mindestens einen Schlitz (53) mit einer sich parallel zur Längsachse (2) erstreckenden Länge, wobei\n- der mindestens eine Schlitz (53) in den Körper (45) integriert oder an diesem befestigt ist,\n- mindestens ein Vorsprung des Mitnehmers (50) greift beweglich in den Schlitz (53) ein.", "9. Die Wasserpistole nach einem der vorhergehenden Ansprüche, dadurch gekennzeichnet, dass der Ventilschaft (35) in Richtung seiner Offenposition gegen den Körper (45) federbelastet ist, zumindest wenn der Körper (45) in seiner Endposition ist.", "10. Die Wasserpistole nach einem der vorhergehenden Ansprüche, dadurch gekennzeichnet, dass der Körper (45) in Richtung seiner Startposition federbelastet ist, zumindest wenn der Körper (45) in seiner Endposition ist.", "11. Die Wasserpistole nach den Ansprüchen 9 und 10, dadurch gekennzeichnet, dass die Vorspannkraft des Körpers (45) in seiner Startposition gegen eine Bewegung in Richtung der Endposition größer ist als die Vorspannkraft des Ventilschafts in seiner Schließposition in Richtung seiner Offenposition und, dass der Körper in seiner Startposition zumindest indirekt an dem Ventilschaft (34) anliegt, wodurch er den Ventilschaft in seine Schließposition zwingt, wenn der Ventilantrieb abgeschaltet ist.", "12. Die Wasserpistole nach einem der vorhergehenden Ansprüche, dadurch gekennzeichnet, dass die Masse des Körpers (45) mindestens so groß ist wie die Summe der Massen des Ventilschafts (35) und des Mitnehmers (50).", "13. Die Wasserpistole nach einem der vorhergehenden Ansprüche, dadurch gekennzeichnet, dass die Wasserpistole weiterhin Folgendes aufweist:\n- Nachfüllöffnung,\n- eine Pumpe mit einem Niederdruckende und einem Hochdruckende, wobei\n∘ das Niederdruckende mit der Nachfüllöffnung oder mit einem Wasserreservoir in Fluidverbindung steht, und\n∘ das Hochdruckende über einen Kanal mit einer Öffnung in der Seitenwand des Schlauches verbunden ist."], "description": ["Field of the invention", "[0001]    The invention relates to a water gun for shooting short bursts of water providing the impression of water bullets. The water gun has at least one pressure tank, at least one nozzle, at least one tube and at least one valve with a valve conduit.", "Description of the related art", "[0002]    Recently, toy water guns for shooting short bursts of water have been suggested, e.g. in  WO 2018/215646 A1 . These short bursts provide the impression of shooting water bullets. To obtain this effect,  WO 2018/215646 A1  suggests storing the water under pressure in a bladder tank. The bladder tank pressurizes water being released via a tube to a lamination unit and from the lamination unit to a nozzle. A valve enables to open and close the connection between the bladder tank and the nozzle in short amounts of time. The valve has a valve seat for a valve plug. The valve plug is controlled by a movably supported valve stem. A complex electrically controlled actuation mechanism shifts the valve stem back and forth, thereby enabling to open the valve for short opening times of about 50ms.", "[0003]    US20030034358A1  suggests an apparatus for dispensing pressurized liquid for example for use in a toy water gun. The apparatus comprises a connection to a source of pressurized liquid, a spring-controlled snap action ball valve assembly including a snap action ball valve, an inlet and an outlet, a conduit in fluid communication from the connection to the valve assembly inlet and a nozzle in fluid communication with the valve assembly outlet. An actuator is connected to the valve assembly to actuate the snap action ball valve from a closed position to an open position and from an open position to a closed position to thereby release water with a minimum of turbulence or other pressure reducing adverse effects.", "[0004]    US2003/0151880 A1  addresses the need of momentarily applying an electric shock to an offending counterpart who is at a relatively remote distance, thereby previously preventing the act of the counterpart of committing a crime. To solve the corresponding problem,  US2003/0151880 A1  suggests an electric shock device with a case taking a shape of a gun or water pistol. A tank being filled with a conductive liquid is disposed in the rear portion of the case and a nozzle is disposed on the top front portion of said shock device case for injecting said conductive liquid. An extra high voltage discharge circuit is located adjacent to the tank and configured to for momentarily discharge an extra high voltage to the nozzle while the fluid passes therethrough and connects the offending counterpart with the extra high voltage discharge circuit. An air tank is configured to pressurize the liquid in the tank and to thereby drive the conductive liquid via a supply pipe to the nozzle. Between the supply line and the nozzle is valve housing, housing a plunger being configured to be moved from a closed position to an open position and to release a valve seat when moved in the open position to thereby control the conductive fluid stream. The rear end of the plunger is attached to a nozzle facing end of a valve stem, which extends through the valve housing. The stem is biased into the closed direction and operated by pulling a trigger. Operation of the shock device requires to open the valve for a minimum time being sufficient that the stream being injected electrically connects the offending counterpart with the extra high circuit.", "Summary of the invention", "[0005]    The invention is based on the observation, that the prior art suggestions are complicated and thus expensive to manufacture. High manufacturing costs are however prohibitive for mass production of toy water guns. Further, the obtained shooting ranges are still short.", "[0006]    The problem being solved by the invention is to ease manufacturing of toy water guns enabling to shoot very short bursts of water, which provide the impression of water bullets while at the same time enable longer shooting ranges at a given water tank pressure.", "[0007]    Solutions of the problem are described in the independent claims. The dependent claims relate to further improvements of the invention.", "[0008]    To provide a clear verbal distinction, herein \"connected to\" indicates a connection enabling a fluid flow from one element to another. A connection can be obtained by mechanically coupling corresponding fluid ports or fluid couplings. The term \"coupling\" in contrast refers herein to a mechanical attachment or another mechanical interaction. Thus, herein we distinguish between fluid connections enabling a fluid flow between two elements and force or torque transmitting couplings of two elements. The distinction is indicated by use of the verbs \"to connect\" or \"to couple\", respectively, knowing that a connection cannot be provided without coupling the elements, but use of the respective terms indicate which aspect the respective sentence focusses on.", "[0009]    Further as usual, herein the undefined article \"a\" is synonymous to \"at least one\". Subsequent use of the defined article \"the\", \"said\", etc. with the same expression are synonymous to \"the at least one\".", "[0010]    The water gun comprises at least a pressure tank ('tank' for short), a nozzle for releasing the water bullets to the environment, a tube connecting the pressure tank with a valve conduit of a valve for controlling the water flow from the tank to the nozzle. The pressure tank has an outlet being connected (preferably directly) to an inlet of the tube and the tube has an outlet being connected (preferably directly) to an inlet port of the valve conduit. An outlet port of the valve conduit is (preferably directly) in fluid communication with the nozzle. This reduced number of parts cuts cost down while at the same time decreasing the flow resistance. Lamination means as suggested in the prior art are preferably omitted and thus the corresponding pressure drop in the flow path can be avoided. The shooting range is thus increased as well.", "[0011]    As usual, the above components may be enclosed in a housing. Preferably, they may be integrated at least in part in the housing. The water gun may further comprise at least one of a battery, a trigger configured to control the valve, e.g. by controlling a valve drive, a refill inlet, a pump for pumping water or a gas (e.g. air) into the tank and other components which are known to the person skilled in the art.", "[0012]    For example, the pressure tank can be a bladder tank as suggested, e.g. in  WO 2018/215646 A1 . In another alternative the pressure tank can be put (intermittently or continuously) in fluid communication with a gas pressure source, pressurizing the water in the tank. The gas pressure source can be a gas cartridge and/or a gas compressor. Typical gas compressors are hand or motor driven air pumps. It should be noted that air is only an example for any gas or mixture of gases. For example CO2-cartridges are commercially available at reasonable costs and could be used a gas pressure sources as well.", "[0013]    Preferably, the water gun further comprises a valve conduit. The valve conduit may be connected (preferably directly) to the outlet of the tube. The valve conduit may have a valve seat in between of its inlet port and its outlet port. For example, the outlet port may at the same time provide the nozzle.", "[0014]    A movable valve stem ('stem' for short) having a valve plug ('plug' for short) may define a first longitudinal axis. The stem may be movably supported to enable a translation of the stem parallel to the first longitudinal axis. The valve plug may be integrally formed with the stem or may be attached to the stem. Preferably, the plug defines a nozzle facing end of the stem. The stem (and thus as well the plug) preferably has a closed position in which the valve plug closes the valve seat and an open position in which the valve plug is retracted to release the valve seat, thereby enabling a flow of fluid through the valve seat and thus from the tank via the tube through the valve conduit to the nozzle. A translation of the valve stem from the closed position to the open position opens the valve. Similarly a translation of the valve stem from the open position to the closed position closes the valve. The time for moving the valve stem between these two positions is referred as opening time or closing time depending on the direction of the translation. To avoid ambiguities, the open position of the valve stem is not necessarily an end position, but the position when a further retraction of the stem away from the valve seat does not have an effect on the flow resistance of the water passing through the valve. The opening and closing times should be short, to enhance the water bullet impression of the short water bursts.", "[0015]    Preferably, the inlet port and the outlet port of the valve conduit are centered on a (second) longitudinal axis. This second longitudinal axis is preferably identical to the first longitudinal axis, being defined by the valve stem. In a preferred example, the outlet of the tube, the valve stem, the inlet port of the valve conduit, the opening being defined by the valve seat and the outlet port or the valve are aligned on a single axis. For a given pressure in the pressure tank, these measures increase the shooting range.", "[0016]    In the open position, the plug and the stem are preferably entirely removed out of the surface being enclosed by the valve seat, to thereby further reduce any pressure drop upstream of the nozzle. This measure as well increases the shooting range.", "[0017]    The tube, as already implicit, has a tube wall. The tube wall encloses a longitudinal extending lumen thereby providing a duct for a fluid, like water, flowing from the tank through the tube outlet to the valve's inlet port. Preferably, the tube wall provides a linear bearing. The linear bearing may movably support the stem. A portion of the stem may extend inside the tube and another portion may extend outside the tube, while the tube provides a linear bearing movably supporting the stem. In other words, the optional linear bearing may movably support the valve stem relative to the tube wall, thereby enabling a translation of the stem along the first longitudinal axis. This is particularly cost efficient and waives the necessity of positioning a bearing supporting the stem in the lumen of the tube. Accordingly, the flow resistance can be further decreased and thus the range of the water gun is increased.", "[0018]    Particularly preferred, the linear bearing sealingly attaches to the valve stem. For example, the linear bearing may be a plain bearing. The plain bearing may have a plain bearing surface enclosing and being in sealing contact with the stem's surface. The bearing surface may be a ring surface and the stem preferably has section with a cylindrical contour, preferably with a circular cylindrical contour, at least in its section sliding through the ring surface. In this example, the ring surface and the contour of the stem section may thus be complementary to each other. Only to avoid ambiguities, we reference to the definition of a cylinder surface as provided in by  Bronstein, Semendyayev, Musiol & Muehlig in Handbook of Mathematics, Springer Berlin Heidelberg, 2007, 5th ed.; Chapter 3.3.4 . Cylinders may have circular and non-circular direction curves and thus corresponding cross sections.", "[0019]    As apparent, the linear bearing may define a through hole in the tube. The stem may extend via the through hole, and thus extend through the tube wall. The stem may plug the through hole. These measures further ease assembly and enhance the range, because a valve drive may positioned and be coupled to a portion of the stem being outside the water containing lumen (tank, tube, valve conduit).", "[0020]    Particularly preferred, the tube has at least two sections: A first section and a second section. The first section may have a first continuously curved neutral phase. In other words, the first section may be continuously curved preferably in a first direction. Similarly, the second section may have a continuously curved neutral phase, as well, wherein the second section is preferably continuously curved in a second direction (the second direction being different from the first direction). The two (i.e. first and second) curvatures preferably have opposite signs and the change of curvature at the intersection of the two sections is preferably continuous, i.e. at the intersection the curvature is preferably zero. The tube may thus have a very low flow resistance thereby increasing the range while at the same time enabling to have laterally offset but at least almost parallel (i.e., parallel ±15°, preferably ±7,5°, ±5° or ±2.5°) inlet and outlet openings of the tube. This provides space to position the valve drive outside the tube or the valve conduit while enabling to maintain momentum of the fluid flowing from the tank through the tube. The curvatures simplify assembly of the water gun while at the same time they increase its range.", "[0021]    The first and second curvatures each preferably may define an arc smaller equal ±45°, more preferred smaller equal ±30°, even more preferred smaller equal ±20°, but preferably bigger equal ±10° or ±15° (smaller and bigger reference to the absolute values of the respective arcs, as the two arcs have opposed curvatures). Smaller absolute values have the advantage of reduced pressure losses due to changes in the direction of fluid flow, but they as well have the disadvantage, that the length of the neutral phase of the tube as a function of the lateral offset orthogonal to the water flow direction through at the respective connections increases. Longer tubes have an increased flow resistance and in addition more fluid and thus more mass needs to be accelerated and subsequently slowed down in the same amount of time by or against, respectively, the pressure in the tank, when releasing a 'water bullet'. The well-balanced choice of curvatures as suggested above further increases the range.", "[0022]    For example, the through hole being defined by the linear bearing may be located in an area of the tube wall, which is in the vicinity of the change of the sign of the curvatures of the first and second neutral phase of the tube. The vicinity is considered to cover a deviation of 25% of the length of the tube or less, preferably 12.5% of the length of the tube. This choice enables to reduce the size of the water gun, further contributing to reducing manufacturing costs. Further, the stem may be centered (at least essentially) in the outlet of the tube, thereby enabling a rather homogenous flow at the outlet of the tube, contributing to an increased range, as well.", "[0023]    The range can be further increased if the net cross sectional area of the tube along the length of the tube is constant at least within 15% (preferably at least within ±10%, ±7,5%, ±5% or ±2.5%) of the mean cross sectional area of the tube, wherein the cross sectional area of the valve stem does not contribute to the cross sectional area of the respective portion of tube. In other words, the inner diameter of the tube is preferably increased in the portion of the tube via which the stem extends, compared to the portion in which the stem does not extend. A reduction of the (net) cross sectional area by the stem is thus preferably accounted for. The increase in tube diameter is preferably continuously, to avoid turbulences. As already apparent, the net cross sectional area of the tube at a given position is the cross sectional area through which a water flow towards the outlet is possible. The cross section of installations in the tube thus is subtracted from the geometric cross sectional area of the tube when calculating the net cross sectional area at given position. As usual, the position in a tube can be expressed by the distance of the cross sectional plane to an end of the tube. The cross sectional planes are preferably at least essentially orthogonal to the mean fluid flow direction at the given position.", "[0024]    The valve further comprises a valve drive. The valve drive is configured for shifting the valve stem from its closed position into its open position and/or back from its open position into its closed position. The valve drive drives a body, for example a plunger, being movably supported and configured to be shifted by the valve drive at least essentially parallel (within ±15°) to the longitudinal axis of the stem from a start position via a first intermediate position to an end position. For example, the body may be driven electromagnetically, e.g. by a solenoid being connected (referencing here to the electric flow, not to the water flow, obviously) via at least one switch to a battery or another electric power source. The solenoid and the body may thus form a solenoid drive.", "[0025]    A valve drive is preferably aligned with the stem, the tube inlet, valve's inlet port, the valve seat and the valve's outlet port and positioned outside the tube, next to the first tube section. This provides for a reduced flow resistance and enables a very compact water gun. Thus, these measures contribute to increasing the shooting range while reducing manufacturing costs.", "[0026]    The body and the valve stem are coupled via a position selective coupling, wherein the position selective coupling is configured to selectively couple the body to the valve stem when the body is at the first intermediate position while the body moves from the start position to the end position. Thus, the position selective coupling enables to accelerate the body prior to entraining the stem in a first phase of opening the valve. In this first phase the body moves from its start to the first intermediate position. During this first phase, the acceleration of the body is not slowed down by the mass of the stem and the plug. At the intermediate position, the coupling becomes effective and the momentum gained by the body is partially and abruptly transferred to the stem. The stem is, at this moment, still in its closed position, and accordingly is translated towards its open position in a reduced amount of time. The valve thus opens in a very short amount of time, thereby releasing a burst of water. Closing of the valve may be obtained in the same (i.e. inverted manner), i.e. the body first gains speed (and thus momentum) when moving from its end position to a second intermediate position. Reaching the second intermediate position the selective coupling becomes effective and the body transfers a portion of its momentum abruptly to the stem, thereby accelerating it from its open position towards its closed position. The selective coupling thus contributes to a short closing time. Both measures contribute to short and appropriately shaped burst of water, increasing the bullet impression and shooting range.", "[0027]    The opening and closing times can be further reduced if the mass of the body is at least as big as the sum of the masses of the valve stem and an optional follower, preferably twice, three-times, four-times or even bigger the sum of the masses of the valve stem and the optional follower.", "[0028]    Preferably, the body is spring biased into its start position, thereby providing a normally closed valve. The energy consumption of the valve drive is kept low.", "[0029]    The position selective coupling comprises a movably supported follower. The follower extends at least partially in and/or over a portion of the body. For example, the follower may be a sleeve into which a portion of the body extends. In another example, the follower comprises a sleeve. The follower and the body are attached to another by a linear bearing. For example, the follower (and/or the body) may have at least one slot and the slot may have a length extending parallel to the first longitudinal axis of the stem. A protrusion of the body (and/or the follower) may movably engage into the slot, thereby limiting the translation of the body relative to the follower to a translation in a direction being parallel to the first longitudinal axis. For example, the protrusion (e.g. of the body) may be a stud being attached to ,e.g., the body or integrally formed by e.g., the body. The slot essentially provides a guide rail for the body. Of course, as already indicated in parentheses, a slot could as well be in the body and the follower may movably engage with a protrusion into the slot of the body.", "[0030]    First and second abutments limit the distance of the relative movement of the body relative to the follower. To make it more vivid, e.g. the body may move relative to the follower until a protrusion of the body contacts an abutment of the follower (or vice versa). Referring to the example above, the body may for example be accelerated by the valve drive to move translationally along the slot towards its end position, until the protrusion hits a first abutment. This defines the first intermediate position, and the follower (almost) instantaneously picks up speed by the transfer of momentum from the body. Thus, the protrusion may move in the slot relative to the follower (assuming the guide rail is attached to or integrated in the follower), when the body moves from its start position to the first intermediate position. At the first intermediate position the body hits the first abutment thereby entraining the follower when further moving towards the body's end position.", "[0031]    By attaching or integrating the follower to or into, respectively, the stem, the selective coupling couples the body with the stem and thus with the plunger. This is a very cheap, yet reliable position selective coupling. Again, it is noted that the position of the protrusion and the guide rail may be swapped without changing the technical teaching.", "[0032]    The first and second optional abutments may be provided by end surfaces of the slot, limiting the longitudinal extension of the slot. However they are not necessarily defined as end surfaces of the slot. Any portion of the follower (or the body, respectively), limiting a translation of the body relative to the follower in the first longitudinal direction can provide a first or second abutment.", "[0033]    The valve drive may for example comprise a solenoid and the body may e.g. comprise paramagnetic material. In this case, to open (and/or close) the valve, a voltage U0 may be provided to the solenoid. A magnetic force accelerates the body from its start position to its end position, initially without entraining the follower and thus without entraining the stem. After a certain time tentrain, the position selective coupling engages and the body entrains the stem towards the stems open position. Preferably, at the time tentrain, the current I(t, U0) through the solenoid is larger or equal 90% (more preferred 95%, 98% or 99%) the maximum current Imax(U0) through the solenoid at the given voltage U0, summarizing:  I t ≥ α ⋅ I max U 0 ∀ t ≥ t entrain , α ∈ 1 y , y ∈ 0.9 0.95 0.98 0.99 .\n<img class=\"EMIRef\" id=\"c2976053-7205-40cc-8ffb-68ce9e67d13d-ib0001\" />", "[0034]    This condition can be obtained, by increasing or decreasing the inductivity of the coil. Increasing the inductivity slows ramp up of the current down (i.e. increases ramp time) and decreasing the inductivity decreases the ramp up time until a given current through the solenoid is established. This measure further reduces the opening and/or closing time(s) of the valve and thereby enhances the formation of water bullets.", "[0035]    In an example, the valve stem may be spring loaded towards its closed, when it it in its open position. Thereby, when reaching its open position the kinetic energy of the stem is stored by the corresponding elastic member ('spring' for short). This reduces the energy consumption of the water gun and further contributes to a short closing time. Particularly preferred, the biasing force of the body at its start position against a movement in the direction of the end position is greater than the biasing force of the valve stem towards its closed position in its open position and in that the body in its start position at least indirectly abuts against the valve stem forcing the valve stem into its closed position, if the valve drive is shut off.", "[0036]    The water gun may comprise a pump, e.g. an electric pump, having a low-pressure end and a high-pressure end. The low-pressure end and a high-pressure end are the inlet and the outlet of the pump, respectively, but to verbally distinguish from the inlet and the outlet of the tube, we will refer herein to the low-pressure end and high-pressure end of the pump. The low-pressure end is preferably in fluid communication with a refill opening of the water gun or with a water reservoir. The high-pressure end is preferably in fluid communication with the pressure tank, e.g. with a bladder tank.", "[0037]    In a preferred example, the high-pressure end is connected via a duct to an opening in the side wall of the tube. For example, the tube may have a connector configured to be connected to the duct. This enables to refill the pressure tank via the tube and the inlet of the tube. Experiments showed surprisingly that the shooting range of the water gun is not significantly reduced by the opening in the side wall of the tube, if the diameter of the opening is smaller or equal to 15%, preferably smaller or equal 10% or even smaller (e.g. 7.5%, 5%, ...) of the tube diameter. At the same time, in particular when the pressure tank is a bladder tank, manufacturing costs are reduced, because it is much easier to attach the duct to a comparatively solid side wall than to an elastic bladder being expanded each time the tank is filled.", "[0038]    The invention has been explained with respect to a toy water gun, but the invention is not limited to water guns. Other liquids may be distributed over a shooting range as well. Pharmaceuticals or herbicides are well known examples for other liquids. Throughout the entire specification the word \"water\" can be replaced by the word \"liquid\" (as well in composed nouns like \"water gun\" becoming \"liquid gun\") without changing the technical teaching of the patent.", "Description of Drawings", "[0039]    In the following the invention will be described by way of example, without limitation of the general inventive concept, on examples of embodiment with reference to the drawings:\nFigure 1  shows a toy water gun,\nFigure 2  shows a front section of the toy water gun,\nFigure 3  shows a perspective view of the position selective coupling of the toy water gun,\nFigure 4  shows an exploded view of the position selective coupling of the toy water gun,\nFigure 5  shows a side view of the position selective coupling,\nFigure 6  shows a longitudinal sectional view along the plane A-A indicated in  Fig. 5  of the position selective coupling,\nFigure 7  shows a follower of the position selective coupling in a perspective view,\nFigure 8  shows a side view of the follower, and\nFigure 9  shows a longitudinal sectional view of the follower.", "[0040]    Figure 1  shows a sectional view of a water gun 1. The water gun has housing 5 supporting components of the water gun 1, e.g. a trigger assembly 6, a controller (omitted for simplicity), batteries 8, etc. The water gun has a pressure tank 10, which in this example is a bladder tank, but other tanks can be used as well. The tank 10 is configured to store a pressurized liquid and has an outlet being connected to the inlet 61 of a tube 60.", "[0041]    For example, the tank can be filled by sucking liquid by a pump 92 via a refill inlet 90 and a check valve 91. The pump 92 pressurizes the liquid and fills the bladder via a pipe.", "[0042]    The outlet of the tank 10 and the inlet 61 of the tube 60 define a plane E. The plane E is orthogonal to the flow direction of the water at the connection between the tank 10 and the tube 60. In this example, the outlet of the tank 10 is directly connected with the tube's inlet 61, being a preferred optional embodiment, i.e. a non-direct connection is possible as well.", "[0043]    The tube 60 has an outlet 65 being connected to the inlet 31 of a valve conduit 38 of a valve 30. The plane D is orthogonal to the flow direction of the water at the connection between the tube 60 and the valve 30.", "[0044]    The valve conduit 38 provides a nozzle 20 for ejecting bursts of liquid to the environment. Again, the depicted direct connections are preferred but indirect connections may be used as well.", "[0045]    As can be seen better in  Fig. 2 , showing the front portion of the water gun 1 in a magnified view, the tube 60 has a tube wall 67. The tube wall 67 may be curved to form a first section 63 and a second section 64. The curvatures become particular apparent when regarding the first neutral phase 62 and second neutral phases 66 of the respective sections 63 and 64 which neutral phases 62, 66 are indicted as dotted lines. The curvatures may have opposite directions, i.e. opposite signs. For example, the first section may be curved upwards and the subsequent section may be curved downwards to thereby define essentially parallel (parallel within ±15° or within ±7.5°) front and rear end surfaces of the tube 60 (cf. planes D and E in  Fig. 1  and  2 ).", "[0046]    These curvatures have a number of advantages. For example they provide a lateral offset of the inlet 61 relative to the outlet 65 of the tube, while at the same time maintaining parallelism of the inlet 61 relative to the outlet 65. The offset provides enables to align a stem 35 with the nozzle 20 (see axis 2), while providing a portion of the stem outside the tube 60. Further, the flow through the inlet 61 and through the outlet 62 is at least essentially parallel to each other, to the flow through a valve seat 32 and to the flow the through the nozzle 20, which contributes to enhancing the range. Laterally offset means, that the centers of the respective connections are offset in a direction being defined by the at least essentially parallel planes E and D, i.e. offset orthogonally to the mean flow direction of water from the inlet 61 to the outlet 65. Saying it differently, water flowing through the tube 60 may have at least essentially the same momentum (in absolute value and direction) at the tube's inlet 61 as at the outlet 65. From the tube's outlet 65, the liquid may enter a valve conduit 38.", "[0047]    The valve conduit 38 may provide the valve seat 32 which may be closed by a valve plug 36. The valve plug 36 may be attached to the nozzle facing end of the valve stem 35 extending along a first longitudinal axis 2. The valve stem 35 may be movably supported by a linear plain bearing 68 being formed, e.g., by the tube wall 67. Preferably, the linear bearing 68 is integrally formed by the tube wall 67, preferably outside the lumen the tube wall 67 encloses. The plain bearing 68 may enable a translation of the valve stem 35 parallel to the longitudinal axis 2, relative to the tube 60 and thus as well relative to the valve seat 32. In  Fig. 1  and  2  the valve stem is shown in the so called closed position, i.e. the valve is closed by plug 36 blocking the passage defined by the valve seat 32. An optional O-ring or another type of gasket may be used to seal a moving gap between the plain bearing surface of the plain bearing 68 and the peripheral complementary surface of the stem 35 (see  Fig. 2 ).", "[0048]    The valve stem 35 may be coupled, e.g. by a position selective coupling to a valve drive 40. Activation of the drive may retract the valve stem 35 and thus open the valve 30. As shown, the valve drive 40 may be a linear drive for example comprising a body 45 and an electromagnet 48 (see  Fig. 1 ) configured to attract the body 45, when connected to a power source, e.g., to the battery 8.", "[0049]    The body 45 may form a part of a position selective coupling being depicted in more detail in  Fig. 3 to 6 . A follower of the position selective coupling is shown in more detail in  Figures 7 to 9 . The position selective coupling couples the stem 35 to the body, i.e. depending on the position of the body 45, the body 45 entrains a follower 50. The follower 50 may be permanently coupled to the stem 35 for example as indicted in  Fig. 2 , e.g., by an attachment member 52.", "[0050]    As shown in  Fig. 3 to 9 , the follower 50 may be a sleeve or at least a portion of the follower 50 may have the shape of a sleeve. The body 45 may be movably supported relative to the follower 50. The follower 50 may comprise at least one slot 53 extending at least essentially parallel (parallel within ±15°, ±7.5°, ±5°, ±2.5° or less) to the first longitudinal axis 2. As can be seen in  Fig. 4  and  9 , the example follower 50 has two of these slots 53, each defining a guide rail 53 for a protrusion being attached to the body 45. Like in this example at least one protrusion may be provided by end sections of a rod 46 extending at least essentially perpendicular (perpendicular within ±15°, ±7.5°, ±5°, ±2.5° or less) to the first longitudinal axis 2 through at least a section of the body 45. As apparent from  Fig. 3  and  Fig. 5 , the end sections of the rod 46, i.e. the protrusions of the body 45 enable a translation of the body 45 relative to the follower 50 in the slots. The slots 53 each have may have a closed end 54 providing a first abutment 54, limiting the relative movement of the body relative to the follower 50. The follower 50 may have a second abutment 55. As shown, the second abutment 55 may be provided by the body 45 facing surface of a bottom 51 of the follower 50. Alternatively or in addition, the second abutment(s) 55 may as well be provided by a closed end of the slot 53.", "[0051]    If the body 45 is accelerated by the valve drive 40 parallel to the first longitudinal axis 2 away from the valve seat 32, the body 45 may move freely parallel to the axis 2 from its start position as shown in  Fig. 1 to 3  and  Fig. 5 and 6 , until the protrusions (see rod 46) contact the first abutments 54. Now a portion of the momentum is transferred to the follower 50 and thus as well to the stem 35, while the body 45 continues to be forced by the drive 40 in the direction away from the valve seat 32. Thus, the valve drive 40 now accelerates the body 45, the follower 50 and the stem 35 with its plug 36, until the body 45 reaches its end position.", "[0052]    When the valve drive 40 is switched off, a return spring 59 biasing the body 45 towards the valve seat 32 accelerates the body 45 towards the valve seat 32, i.e. towards the body's start position (start position is shown in  Fig. 1 ,  2 ,  3 ,  5 and 6 ). During a first portion of this movement, the body 45 does not entrain the follower 50, as the protrusions (see rod 46) may slide through the slots 53. The situation changes, as soon as the body 45 reaches a second intermediate position where it abuts the second abutment 55, abruptly entraining the follower and thus the valve stem 45 towards the valve seat 32 until body 45 reaches its start position and the valve stem 35 reaches its closed position as shown in  Fig. 1  and  2 .", "[0053]    An optional damping spring 49 may be positioned between the follower 50 and the body 45, biasing the follower 50 towards the valve seat 32.", "List of reference numerals", "[0054]    \n1 : water gun\n2 : longitudinal axis\n5 : housing\n6 : trigger assembly\n8 : batteries\n10 : reservoir / pressure tank\n20 : nozzle\n30 : valve (normally closed)\n31 : inlet port\n32 : valve seat (\"seat\")\n35 : valve stem (\"stem\")\n36 : valve plug (\"plug\")\n38 : valve conduit\n40 : valve drive\n45 : body/ plunger\n46 : rod (providing protrusions of body)\n48 : electro-magnet\n49 : damping spring\n50 : follower\n51 : bottom\n52 : attachment member\n53 : guide rail (longitudinal slot)\n54 : first abutment\n55 : second abutment\n59 : biasing spring\n60 : connecting tube\n61 : inlet\n62 : first neutral phase\n63 : first section\n64 : second section\n65 : outlet\n66 : second neutral phase\n67 : tube wall\n68 : linear bearing\n90 : refill inlet\n91 : check valve\n92 : pump"]}